#给妹子讲python
#S01E04

# 1.遍历容器的基本方法
# 2.列表解析式和字典解析式的用法

#--------------------------------------------------#

for x in [1,2,3,]:
	print(x)

# 遍历字典的方法
# 第一种：利用索引
D = {'a':1, 'c':2, 'b':3}
for k in D:
	print('{} : {}'.format(k,D[k]))
# 第二种：items()方法
for k,v in D.items():
	print('{} : {}'.format(k,v))

# 列表解析式三要素：
# 运算表达式-->循环表达式-->过滤条件
a = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
b = [x**2 for x in a if x % 3 == 0]
print(b)

# 字典解析式
D1 = {'a': 1, 'b': 2, 'c': 3}
D2 = {k:v*2 for (k, v) in D1.items()}
print(D2)

#--------------------------------------------------#