#给妹子讲python
#S01E03

# 1.元组是不可变的列表
# 2.元组的访问和元素的获取
# 3.基于位置偏移的索引和分片操作与列表相同
# 4.如何对不可变的元组进行排序

#--------------------------------------------------#

T = (1, 2, 3, 4)
M = ('spam', 3.0, [11,22,33])
print(T[1])
print(M[2][0])

a,b = (1,2)
print('a={},b={}'.format(a,b))

# 元组的连接
T1 = (1,2,3,4)
T2 = (5,6,7,8)
print(T1 + T2)

# 若要排序先转化为列表然后转回元组
T3 = ('cc','bb','dd','aa')
tmp = list(T3)
tmp.sort()
T3 = tuple(tmp)
print(T3)

# 利用sorted()函数返回一个排好序的list

T4 = ('cc','bb','dd','aa')
print(sorted(T4))

#--------------------------------------------------#