# 给妹子讲python
# S01E20

# 1.函数参数传递的实现过程
# 2.可变对象和不可变对象参数传递、修改的区别
# 3.如何避免不可变对象参数传递的本地修改

#--------------------------------------------------#

# 函数头部的参数名是一个新的、本地的变量名

# 在函数内部直接把本地变量a重置为了一个完全不同的新对象，所以他不会影响最初的变量b
def f(a):
    a = 99
    print(a)

b = 88
f(b)
print(b)

# 对列表和字典这样的可变对象的原处修改可能在函数退出后依然有效
# 共同引用的对象被本地修改
def change(a,b):
	a = 2
	b[0] = 'spam'

x = 1
l = [1,2]
change(x,l)
print(x,l)

# 可以我们可以简单的创建一个明确的可变对象的拷贝来防止修改
def change(a,b):
    a = 2
    b[0] = 'spam'

x = 1
l = [1,2]
change(x,l[:])
print(x,l)

# 或者在函数内部进行拷贝
def change(a,b):
	b = b[:]
	a = 2
	b[0] = 'spam'
	print(b)

x = 1
l = [1, 2]
change(x,l)
print(x,l)

#--------------------------------------------------#